public class Main {
    public static void main(String[] args) {
        // Задание 1
        int age = 19;
        if (age >= 18) {
            System.out.println("поздравляем с совершеннолетием!");
        }
        if (age < 18) {
            System.out.println("возраст совершеннолетия ещё не наступил, нужно немного подождать.");
        }
    }
}